문제 1( 10점)
중간고사, 기말고사, 과제 점수를 모두 합한 10명의 학생의 점수를 구하는 코드를 zip을 이용하여 작성하여 리스트에 넣고, 점수가 높은 순서대로 정렬하시오.

리스트 순서대로 1명의 학생입니다
예) 첫번째 학생 34+45+5 = 84

아래 코드를 실행시키고문제에 답하시오.

In [1]:
중간고사 = [34, 30, 26, 40, 33, 15, 31, 21, 17, 40]
기말고사 = [45, 48, 25, 50, 50, 28, 39, 33, 47, 42]
과제 = [5, 10, 8, 10, 10, 7, 7, 9, 10, 2]

총점 = []

for i, j, k in zip(중간고사, 기말고사, 과제):
    총점.append(i + j + k)
    
총점.sort(reverse = True)
print(총점)

[100, 93, 88, 84, 84, 77, 74, 63, 59, 50]

문제 2 (20점)
비타민에서는 동아리 지원시 개별 지원번호가 부여된다.
지원번호를 입력하면 성별, 기수, 편입여부, 운영진여부 를 출력하는 프로그램을 작성하시오.
지원번호는 앞에서 부터 순서대로 합격시 활동시작연도 -활동시작학기(1학기,2학기)- 성별(1- 편입아니고 남자,2- 편입아니고 여자, 3-편입이고 남자, 4-편입이고 여자)-임의 부여번호2자리 - 운영진 여부(운영진이면 s)

비타민은 18년도 1학기부터 시작되었다. (1기)

예) 21-1-1-37-s 1학기 남자 (-는 이해를 돕기위해 추가한 예시)

In [2]:
input = input('지원번호를 입력하세요: ')

if input[3] == '1' or input[3] == '3':
    print('성별: 남')
else:
    print('성별: 여')
    

if input[3] == '1' or input[3] == '2' :
    print('기수: ',((2000+int(input[:2])) -2018)*2 + int(input[2]))
    print('편입: x ' )
else :
    print('기수: ',((2000+int(input[:2])) -2018)*2 + int(input[2])-1)
    print('편입: o')
if input[-1] == 's' :
    print('운영진: o ')
else :
    print('운영진: x ')

지원번호를 입력하세요:  211137s

성별: 남
기수:  7
편입: x
운영진: o

문제3 pandas를 활용해 각 문항에 따라 답하시오.

아래 코드를 실행시키고문제에 답하시오.

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

3-1 (5점)
titanic.csv를 불러와 titanic에 저장하시오.

In [4]:
titanic=sns.load_dataset('titanic')
titanic

# titanic = pd.read_csv('titanic.csv')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

3-2 (10점)
titanic에서 Pclass, Age, Fare 열을 index 0부터 100까지 뽑아 df에 저장하시오.

(loc ,iloc 둘 중 적어도 하나 사용)

In [5]:
df = titanic.loc[:, ['pclass', 'age', 'fare']].iloc[:101,:];df

     pclass   age     fare
0         3  22.0   7.2500
1         1  38.0  71.2833
2         3  26.0   7.9250
3         1  35.0  53.1000
4         3  35.0   8.0500
..      ...   ...      ...
96        1  71.0  34.6542
97        1  23.0  63.3583
98        2  34.0  23.0000
99        2  34.0  26.0000
100       3  28.0   7.8958

[101 rows x 3 columns]

3-3 (5점)
df에서 pclass 열을 버리고 버려졌는지 df를 불러서 확인하시오.

In [7]:
df.drop('pclass',axis=1,inplace=True)
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
96   71.0  34.6542
97   23.0  63.3583
98   34.0  23.0000
99   34.0  26.0000
100  28.0   7.8958

[101 rows x 2 columns]

3-4 (5점)
df의 열별로 결측치가 몇개 존재하는지 확인하시오.

In [8]:
df.isnull().sum()

age     22
fare     0
dtype: int64

3-5 (5점)
df에 결측치가 있다면 그 다음 데이터로 채우시오.(index 숫자가 더 큰 = 다음)

In [9]:
df.bfill(inplace=True)

3-6 (10점)
df에서 Age가 40 이상인 행을 모두 뽑고 Age가 내림차순으로 정렬되도록 데이터프레임을 구성하시오.(데이터프레임에는 Age열과 Fare열이 모두 있어야함)

In [11]:
df.query('age>=40').sort_values(by='age',ascending=False)

     age      fare
96  71.0   34.6542
95  71.0    8.0500
31  66.0  146.5208
32  66.0    7.7500
33  66.0   10.5000
54  65.0   61.9792
94  59.0    7.2500
11  58.0   26.5500
15  55.0   16.0000
6   54.0   51.8625
5   54.0    8.4583
52  49.0   76.7292
92  46.0   61.1750
62  45.0   83.4750
35  42.0   52.0000
29  40.0    7.8958
30  40.0   27.7208
28  40.0    7.8792
40  40.0    9.4750

3-7 (10점)
df.Fare를 평균이 0이고 분산이 1인 가우시안 정규분포를 가진 값으로 변환하려하는데 표준화하는 수식을 코드로 작성하고 lambda를 이용하여 df의 Fare 열을 표준화하시오.

In [13]:
mean = df.fare.mean()
std = df.fare.std()
df.fare.apply(lambda x : (x-mean)/std)

0     -0.540207
1      1.028304
2     -0.523673
3      0.582900
4     -0.520611
         ...
96     0.131066
97     0.834179
98    -0.154407
99    -0.080921
100   -0.524388
Name: fare, Length: 101, dtype: float64

3-8 (20점)
titanic에서 Name에서 first name만을 뽑아 새로운 열인 First_Name을 titanic에 추가하시오.

참고 : johann + Sebastian + Bach

(First name) +(Middle name) + (Surname)

In [16]:
# titanic['First_Name']=titanic.name.apply(lambda x : x.split(',')[0])
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True